NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_flpr.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>GLOBAL_GPIOHSPADCTRL_S</name>
      <description>GPIO high-speed pad control</description>
      <baseAddress>0x50050400</baseAddress>
      <headerStructName>GPIOHSPADCTRL</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>GPIOHSPADCTRL</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>BIAS</name>
          <description>Bias control</description>
          <addressOffset>0x30</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>HSBIAS</name>
              <description>Slew setting for high-speed pad (higher value is faster)</description>
              <lsb>0</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>REPLICABIAS00</name>
              <description>Slew setting for replica clock (used by the MSPI00 peripheral)</description>
              <lsb>2</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>REPLICABIAS01</name>
              <description>Slew setting for replica clock (used by the MSPI01 peripheral)</description>
              <lsb>3</lsb>
              <msb>3</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>OVERRIDE</name>
          <description>Override control</description>
          <addressOffset>0x34</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>FORCEON</name>
              <description>Force on</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>ATB0</name>
              <description>ATB0 settings</description>
              <lsb>1</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BiasTrim</name>
                  <description>Unspecified</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BiasSupply</name>
                  <description>Unspecified</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BiasPTAT</name>
                  <description>Unspecified</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DUALDRIVE</name>
              <description>Drive pad from both high-speed pad and regular pad (when highspeed is enabled)</description>
              <lsb>4</lsb>
              <msb>4</msb>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CTRL[%s]</name>
          <description>Description collection: Input sampling and buffering control (used by the MSPI0n peripheral)</description>
          <addressOffset>0x38</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>RXDELAY</name>
              <description>Delay selection</description>
              <lsb>0</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>SCKEN</name>
              <description>Enable SCK</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Delay chain is reset and delayed sampling is disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Delay chain and delayed sampling is active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCKPHASE</name>
              <description>Feedback serial clock (SCKFB) sampling edge for input data</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Rising</name>
                  <description>Sample on SCK rising edge</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Falling</name>
                  <description>Sample on SCK falling edge</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATAENABLE</name>
              <description>Enable delayed sampling</description>
              <lsb>6</lsb>
              <msb>9</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Delayed sampling is disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Delayed sampling is enabled</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REPLICACLKLOAD</name>
              <description>Load capacitor used by replica clock pad</description>
              <lsb>12</lsb>
              <msb>13</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Cap0p75</name>
                  <description>Load capacitance of 0.75 pF</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Cap1p50</name>
                  <description>Load capacitance of 1.5 pF</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Cap2p25</name>
                  <description>Load capacitance of 2.25 pF</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Cap3p00</name>
                  <description>Load capacitance of 3.0 pF</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OUTPUTCPOL</name>
              <description>Serial clock (SCK) polarity for output data delay</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ActiveHigh</name>
                  <description>Active high (idle state low)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ActiveLow</name>
                  <description>Active low (idle state high)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OUTPUTCHPA</name>
              <description>Serial clock (SCK) phase for output data delay</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Leading</name>
                  <description>Sample on leading edge of clock</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Trailing</name>
                  <description>Sample on trailing edge of clock</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CSNPOL</name>
              <description>Chip Select (CSN) Polarity</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Active low (idle state high)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>Active high (idle state low)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCKFBPADEN</name>
              <description>Set IE/OE of the SCK feedback (FB) pad. This field needs to be set before SCKEN.</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>FB pad IE/OE disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>FB pad IE/OE enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
