NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_flpr.svd
        <cluster>
          <name>EVENTS_DMA</name>
          <description>Peripheral events.</description>
          <headerStructName>PWM_EVENTS_DMA</headerStructName>
          <access>read-write</access>
          <addressOffset>0x124</addressOffset>
          <cluster>
            <dim>2</dim>
            <dimIncrement>0x00C</dimIncrement>
            <name>SEQ[%s]</name>
            <description>Peripheral events.</description>
            <headerStructName>PWM_EVENTS_DMA_SEQ</headerStructName>
            <access>read-write</access>
            <addressOffset>0x000</addressOffset>
            <register>
              <name>END</name>
              <description>Description cluster: Generated after all MAXCNT bytes have been transferred</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>END</name>
                  <description>Generated after all MAXCNT bytes have been transferred</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NotGenerated</name>
                      <description>Event not generated</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Generated</name>
                      <description>Event generated</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>READY</name>
              <description>Description cluster: Generated when EasyDMA has buffered the .PTR and .MAXCNT registers for the channel, allowing them to be written to prepare for the next sequence.</description>
              <addressOffset>0x004</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>READY</name>
                  <description>Generated when EasyDMA has buffered the .PTR and .MAXCNT registers for the channel, allowing them to be written to prepare for the next sequence.</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NotGenerated</name>
                      <description>Event not generated</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Generated</name>
                      <description>Event generated</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>BUSERROR</name>
              <description>Description cluster: An error occured during the bus transfer.</description>
              <addressOffset>0x008</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>BUSERROR</name>
                  <description>An error occured during the bus transfer.</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NotGenerated</name>
                      <description>Event not generated</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Generated</name>
                      <description>Event generated</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
          </cluster>
        </cluster>
        <register>
          <dim>0x4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>EVENTS_COMPAREMATCH[%s]</name>
          <description>Description collection: This event is generated when the compare matches for the compare channel [n].</description>
          <addressOffset>0x13C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>EVENTS_COMPAREMATCH</name>
              <description>This event is generated when the compare matches for the compare channel [n].</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_STOPPED</name>
          <description>Publish configuration for event STOPPED</description>
          <addressOffset>0x184</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>DPPI channel that event STOPPED will publish to</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable publishing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable publishing</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>PUBLISH_SEQSTARTED[%s]</name>
          <description>Description collection: Publish configuration for event SEQSTARTED[n]</description>
          <addressOffset>0x188</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>DPPI channel that event SEQSTARTED[n] will publish to</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable publishing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable publishing</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>PUBLISH_SEQEND[%s]</name>
          <description>Description collection: Publish configuration for event SEQEND[n]</description>
          <addressOffset>0x190</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>DPPI channel that event SEQEND[n] will publish to</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable publishing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable publishing</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_PWMPERIODEND</name>
          <description>Publish configuration for event PWMPERIODEND</description>
          <addressOffset>0x198</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>DPPI channel that event PWMPERIODEND will publish to</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable publishing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable publishing</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_LOOPSDONE</name>
          <description>Publish configuration for event LOOPSDONE</description>
          <addressOffset>0x19C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>DPPI channel that event LOOPSDONE will publish to</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable publishing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable publishing</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_RAMUNDERFLOW</name>
          <description>Publish configuration for event RAMUNDERFLOW</description>
          <addressOffset>0x1A0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>DPPI channel that event RAMUNDERFLOW will publish to</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable publishing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable publishing</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <name>PUBLISH_DMA</name>
          <description>Publish configuration for events</description>
          <headerStructName>PWM_PUBLISH_DMA</headerStructName>
          <access>read-write</access>
          <addressOffset>0x1A4</addressOffset>
          <cluster>
            <dim>2</dim>
            <dimIncrement>0x00C</dimIncrement>
            <name>SEQ[%s]</name>
            <description>Publish configuration for events</description>
            <headerStructName>PWM_PUBLISH_DMA_SEQ</headerStructName>
            <access>read-write</access>
            <addressOffset>0x000</addressOffset>
            <register>
              <name>END</name>
              <description>Description cluster: Publish configuration for event END</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>CHIDX</name>
                  <description>DPPI channel that event END will publish to</description>
                  <lsb>0</lsb>
                  <msb>7</msb>
                </field>
                <field>
                  <name>EN</name>
                  <lsb>31</lsb>
                  <msb>31</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disabled</name>
                      <description>Disable publishing</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Enabled</name>
                      <description>Enable publishing</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>READY</name>
              <description>Description cluster: Publish configuration for event READY</description>
              <addressOffset>0x004</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>CHIDX</name>
                  <description>DPPI channel that event READY will publish to</description>
                  <lsb>0</lsb>
                  <msb>7</msb>
                </field>
                <field>
                  <name>EN</name>
                  <lsb>31</lsb>
                  <msb>31</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disabled</name>
                      <description>Disable publishing</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Enabled</name>
                      <description>Enable publishing</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>BUSERROR</name>
              <description>Description cluster: Publish configuration for event BUSERROR</description>
              <addressOffset>0x008</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>CHIDX</name>
                  <description>DPPI channel that event BUSERROR will publish to</description>
                  <lsb>0</lsb>
                  <msb>7</msb>
                </field>
                <field>
                  <name>EN</name>
                  <lsb>31</lsb>
                  <msb>31</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disabled</name>
                      <description>Disable publishing</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Enabled</name>
                      <description>Enable publishing</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
          </cluster>
        </cluster>
        <register>
          <dim>0x4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>PUBLISH_COMPAREMATCH[%s]</name>
          <description>Description collection: Publish configuration for event COMPAREMATCH[n]</description>
          <addressOffset>0x1BC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>DPPI channel that event COMPAREMATCH[n] will publish to</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable publishing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable publishing</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
