NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_flpr.svd
          <cluster>
            <name>CRACENTAMP</name>
            <description>Enable tamper detector from CRACEN.</description>
            <headerStructName>TAMPC_PROTECT_CRACENTAMP</headerStructName>
            <access>read-write</access>
            <addressOffset>0x438</addressOffset>
            <register>
              <name>CTRL</name>
              <description>Control register for CRACEN tamper detector enable signal.</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000011</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>VALUE</name>
                  <description>Set value of CRACEN tamper detector enable signal.</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Low</name>
                      <description>Signal is logic 0.</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>High</name>
                      <description>Signal is logic 1.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>LOCK</name>
                  <description>Lock this register to prevent changes to the VALUE field until next reset.</description>
                  <lsb>1</lsb>
                  <msb>1</msb>
                  <access>writeonce</access>
                  <modifiedWriteValues>oneToSet</modifiedWriteValues>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disabled</name>
                      <description>Lock disabled.</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Enabled</name>
                      <description>Lock enabled.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>WRITEPROTECTION</name>
                  <description>The write protection must be cleared to allow updates to the VALUE field.</description>
                  <lsb>4</lsb>
                  <msb>7</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disabled</name>
                      <description>Read: Write protection is disabled.</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Enabled</name>
                      <description>Read: Write protection is enabled.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Clear</name>
                      <description>Write: Value to clear write protection.</description>
                      <value>0xF</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>KEY</name>
                  <description>Required write key for upper 16 bits. Must be included in all register write operations.</description>
                  <lsb>16</lsb>
                  <msb>31</msb>
                  <access>write-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>KEY</name>
                      <description>Write key value.</description>
                      <value>0x50FA</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>STATUS</name>
              <description>Status register for CRACEN tamper detector enable signal.</description>
              <addressOffset>0x004</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <size>0x20</size>
              <fields>
                <field>
                  <name>ERROR</name>
                  <description>Error detection status.</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NoError</name>
                      <description>No error detected.</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Error</name>
                      <description>Error detected.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
          </cluster>
          <cluster>
            <name>GLITCHSLOWDOMAIN</name>
            <description>Enable slow domain glitch detectors.</description>
            <headerStructName>TAMPC_PROTECT_GLITCHSLOWDOMAIN</headerStructName>
            <access>read-write</access>
            <addressOffset>0x440</addressOffset>
            <register>
              <name>CTRL</name>
              <description>Control register for slow domain glitch detectors enable signal.</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000011</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>VALUE</name>
                  <description>Set value of slow domain glitch detectors enable signal.</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Low</name>
                      <description>Signal is logic 0.</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>High</name>
                      <description>Signal is logic 1.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>LOCK</name>
                  <description>Lock this register to prevent changes to the VALUE field until next reset.</description>
                  <lsb>1</lsb>
                  <msb>1</msb>
                  <access>writeonce</access>
                  <modifiedWriteValues>oneToSet</modifiedWriteValues>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disabled</name>
                      <description>Lock disabled.</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Enabled</name>
                      <description>Lock enabled.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>WRITEPROTECTION</name>
                  <description>The write protection must be cleared to allow updates to the VALUE field.</description>
                  <lsb>4</lsb>
                  <msb>7</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disabled</name>
                      <description>Read: Write protection is disabled.</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Enabled</name>
                      <description>Read: Write protection is enabled.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Clear</name>
                      <description>Write: Value to clear write protection.</description>
                      <value>0xF</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>KEY</name>
                  <description>Required write key for upper 16 bits. Must be included in all register write operations.</description>
                  <lsb>16</lsb>
                  <msb>31</msb>
                  <access>write-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>KEY</name>
                      <description>Write key value.</description>
                      <value>0x50FA</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>STATUS</name>
              <description>Status register for slow domain glitch detectors enable signal.</description>
              <addressOffset>0x004</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <size>0x20</size>
              <fields>
                <field>
                  <name>ERROR</name>
                  <description>Error detection status.</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NoError</name>
                      <description>No error detected.</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Error</name>
                      <description>Error detected.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
          </cluster>
          <cluster>
            <name>GLITCHFASTDOMAIN</name>
            <description>Enable fast domain glitch detectors.</description>
            <headerStructName>TAMPC_PROTECT_GLITCHFASTDOMAIN</headerStructName>
            <access>read-write</access>
            <addressOffset>0x448</addressOffset>
            <register>
              <name>CTRL</name>
              <description>Control register for fast domain glitch detectors enable signal.</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000011</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>VALUE</name>
                  <description>Set value of fast domain glitch detector's enable signal.</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Low</name>
                      <description>Signal is logic 0.</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>High</name>
                      <description>Signal is logic 1.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>LOCK</name>
                  <description>Lock this register to prevent changes to the VALUE field until next reset.</description>
                  <lsb>1</lsb>
                  <msb>1</msb>
                  <access>writeonce</access>
                  <modifiedWriteValues>oneToSet</modifiedWriteValues>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disabled</name>
                      <description>Lock disabled.</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Enabled</name>
                      <description>Lock enabled.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>WRITEPROTECTION</name>
                  <description>The write protection must be cleared to allow updates to the VALUE field.</description>
                  <lsb>4</lsb>
                  <msb>7</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disabled</name>
                      <description>Read: Write protection is disabled.</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Enabled</name>
                      <description>Read: Write protection is enabled.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Clear</name>
                      <description>Write: Value to clear write protection.</description>
                      <value>0xF</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>KEY</name>
                  <description>Required write key for upper 16 bits. Must be included in all register write operations.</description>
                  <lsb>16</lsb>
                  <msb>31</msb>
                  <access>write-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>KEY</name>
                      <description>Write key value.</description>
                      <value>0x50FA</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>STATUS</name>
              <description>Status register for fast domain glitch detectors enable signal.</description>
              <addressOffset>0x004</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <size>0x20</size>
              <fields>
                <field>
                  <name>ERROR</name>
                  <description>Error detection status.</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NoError</name>
                      <description>No error detected.</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Error</name>
                      <description>Error detected.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
          </cluster>
          <cluster>
            <name>EXTRESETEN</name>
            <description>Trigger a reset when tamper is detected by the external tamper detectors.</description>
            <headerStructName>TAMPC_PROTECT_EXTRESETEN</headerStructName>
            <access>read-write</access>
            <addressOffset>0x470</addressOffset>
            <register>
              <name>CTRL</name>
              <description>Control register for external tamper reset enable signal.</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000010</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>VALUE</name>
                  <description>Set value of external tamper reset enable signal.</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Low</name>
                      <description>Signal is logic 0.</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>High</name>
                      <description>Signal is logic 1.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>LOCK</name>
                  <description>Lock this register to prevent changes to the VALUE field until next reset.</description>
                  <lsb>1</lsb>
                  <msb>1</msb>
                  <access>writeonce</access>
                  <modifiedWriteValues>oneToSet</modifiedWriteValues>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disabled</name>
                      <description>Lock disabled.</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Enabled</name>
                      <description>Lock enabled.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>WRITEPROTECTION</name>
                  <description>The write protection must be cleared to allow updates to the VALUE field.</description>
                  <lsb>4</lsb>
                  <msb>7</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disabled</name>
                      <description>Read: Write protection is disabled.</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Enabled</name>
                      <description>Read: Write protection is enabled.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Clear</name>
                      <description>Write: Value to clear write protection.</description>
                      <value>0xF</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>KEY</name>
                  <description>Required write key for upper 16 bits. Must be included in all register write operations.</description>
                  <lsb>16</lsb>
                  <msb>31</msb>
                  <access>write-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>KEY</name>
                      <description>Write key value.</description>
                      <value>0x50FA</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>STATUS</name>
              <description>Status register for external tamper reset enable signal.</description>
              <addressOffset>0x004</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <size>0x20</size>
              <fields>
                <field>
                  <name>ERROR</name>
                  <description>Error detection status.</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NoError</name>
                      <description>No error detected.</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Error</name>
                      <description>Error detected.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
          </cluster>
